practice-for-ch-rails-first-routes-long-practice-main/FirstRoutes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 5], ["viewer_id", 10], ["created_at", "2023-09-28 17:45:23.859587"], ["updated_at", "2023-09-28 17:45:23.859587"]]
---
    def create
        artwork_shares = ArtworkShare.new(artwork_shares_params)
        if artwork_shares.save

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]
---
    def destroy
        artwork_shares = ArtworkShare.find_by(id: params[:id])
        if artwork_shares && artwork_shares.destroy