practice-for-ch-rails-first-routes-long-practice-main/FirstRoutes/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
        user = User.find_by(id: params[:id])
        if user && user.destroy